Revit.Elements.GlobalParameter
Revit Global Parameters

Revit.Elements.GlobalParameter.InternalGlobalParameter
Internal reference to Element

Revit.Elements.GlobalParameter.InternalElement
Reference to the Element

Revit.Elements.GlobalParameter.#ctor(Autodesk.Revit.DB.GlobalParameter)
Private constructor for wrapping an existing Element
grid:

Revit.Elements.GlobalParameter.#ctor(System.String,Autodesk.Revit.DB.ParameterType)
GlobalParameter
name:
type:

Revit.Elements.GlobalParameter.InitGlobalParameter(Autodesk.Revit.DB.GlobalParameter)
Initialize a GlobalParameter element
grid:

Revit.Elements.GlobalParameter.InitGlobalParameter(System.String,Autodesk.Revit.DB.ParameterType)
Initialize a GlobalParameter element
line:

Revit.Elements.GlobalParameter.InternalSetGlobalParameter(Autodesk.Revit.DB.GlobalParameter)
Set the internal Element, ElementId, and UniqueId
grid:

Revit.Elements.GlobalParameter.FindByName(System.String)
Find Global Parameter by Name
name:
Returns:

Revit.Elements.GlobalParameter.Name
Get Name

Revit.Elements.GlobalParameter.Value
Get Global Parameter Value

Revit.Elements.GlobalParameter.SetValue(Revit.Elements.GlobalParameter,System.Object)
Set Global Parameter Value
parameter:
value:

Revit.Elements.GlobalParameter.SetValueToElementId(Revit.Elements.GlobalParameter,System.Int32)
Set Global Parameter Value to an Element ID from Integer
parameter:
elementId:

Revit.Elements.GlobalParameter.ParameterGroup
Get Parameter Group

Revit.Elements.GlobalParameter.Visible
Get Parameter Visibility

Revit.Elements.GlobalParameter.ParameterType
Get Parameter Type

Revit.Elements.GlobalParameter.ByName(System.String,System.String)
Create a new Global Parameter by Name and Type
name: Name fo the parameter
parameterType: Parameter type
Returns:

Revit.Elements.GlobalParameter.FromExisting(Autodesk.Revit.DB.GlobalParameter,System.Boolean)
Wrap an existing Element in the associated DS type
grid:
isRevitOwned:
Returns: